# MepSpotTopElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepSpotTopElevation Property
ParameterTypeId Class See Also
---
"Spot Top Elevation": used for both design and fabrication components
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepSpotTopElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepSpotTopElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepSpotTopElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace